rorke-time/sriov_rorke_time/rorke25-memtier-250k.txt
Executing: memtier_benchmark -h 128.110.218.200 -p 11211 --ratio=1:10 --test-time=30 --rate-limiting=1250 -t 8 -c 25 --key-pattern=P:P --key-maximum 1000000 -P memcache_text
8         Threads
25        Connections per thread
30        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         6569.17          ---          ---         2.78884         1.61500        42.75100        68.60700       441.96 
Gets        65657.81     17541.32     48116.49         2.76314         1.59100        42.49500        69.11900      2639.13 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      72226.98     17541.32     48116.49         2.76548         1.59900        42.49500        69.11900      3081.08 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.215        0.000
SET       1.207        5.000
SET       1.271       10.000
SET       1.327       15.000
SET       1.367       20.000
SET       1.399       25.000
SET       1.431       30.000
SET       1.471       35.000
SET       1.511       40.000
SET       1.559       45.000
SET       1.615       50.000
SET       1.639       52.500
SET       1.671       55.000
SET       1.711       57.500
SET       1.759       60.000
SET       1.815       62.500
SET       1.887       65.000
SET       1.999       67.500
SET       2.319       70.000
SET       2.639       72.500
SET       2.815       75.000
SET       2.895       76.250
SET       2.959       77.500
SET       3.055       78.750
SET       3.135       80.000
SET       3.215       81.250
SET       3.311       82.500
SET       3.407       83.750
SET       3.503       85.000
SET       3.599       86.250
SET       3.695       87.500
SET       3.759       88.125
SET       3.807       88.750
SET       3.871       89.375
SET       3.919       90.000
SET       3.983       90.625
SET       4.031       91.250
SET       4.095       91.875
SET       4.159       92.500
SET       4.255       93.125
SET       4.319       93.750
SET       4.351       94.062
SET       4.415       94.375
SET       4.447       94.688
SET       4.511       95.000
SET       4.543       95.312
SET       4.607       95.625
SET       4.703       95.938
SET       4.767       96.250
SET       4.895       96.562
SET       5.023       96.875
SET       5.119       97.031
SET       5.279       97.188
SET       5.535       97.344
SET       5.951       97.500
SET       6.559       97.656
SET       7.039       97.812
SET       7.391       97.969
SET       7.743       98.125
SET       8.159       98.281
SET       8.767       98.438
SET       9.279       98.516
SET      12.799       98.594
SET      29.695       98.672
SET      35.327       98.750
SET      38.143       98.828
SET      40.447       98.906
SET      42.239       98.984
SET      44.031       99.062
SET      45.311       99.141
SET      47.103       99.219
SET      47.871       99.258
SET      48.895       99.297
SET      49.919       99.336
SET      50.431       99.375
SET      51.455       99.414
SET      52.223       99.453
SET      52.991       99.492
SET      54.015       99.531
SET      55.039       99.570
SET      56.319       99.609
SET      56.575       99.629
SET      57.343       99.648
SET      58.111       99.668
SET      58.623       99.688
SET      59.391       99.707
SET      59.903       99.727
SET      60.927       99.746
SET      61.951       99.766
SET      62.463       99.785
SET      63.231       99.805
SET      63.743       99.814
SET      63.999       99.824
SET      64.511       99.834
SET      65.023       99.844
SET      65.535       99.854
SET      66.559       99.863
SET      66.559       99.873
SET      67.071       99.883
SET      67.583       99.893
SET      68.607       99.902
SET      68.607       99.907
SET      69.631       99.912
SET      69.631       99.917
SET      70.143       99.922
SET      70.143       99.927
SET      71.167       99.932
SET      71.679       99.937
SET      72.703       99.941
SET      73.215       99.946
SET      73.727       99.951
SET      74.239       99.954
SET      74.751       99.956
SET      74.751       99.958
SET      75.263       99.961
SET      75.775       99.963
SET      76.287       99.966
SET      76.799       99.968
SET      77.823       99.971
SET      78.335       99.973
SET      79.871       99.976
SET      80.383       99.977
SET      80.383       99.978
SET      80.895       99.979
SET      81.919       99.980
SET      81.919       99.982
SET      83.455       99.983
SET      84.479       99.984
SET      84.991       99.985
SET      86.015       99.987
SET      87.039       99.988
SET      87.551       99.988
SET      88.575       99.989
SET      89.599       99.990
SET      92.159       99.990
SET      94.207       99.991
SET      96.255       99.991
SET      96.767       99.992
SET      97.279       99.993
SET      97.279       99.993
SET     100.351       99.994
SET     101.887       99.994
SET     103.935       99.995
SET     103.935       99.995
SET     103.935       99.995
[...]
SET     105.471       99.996
SET     105.471       99.996
SET     105.471       99.996
SET     106.495       99.997
SET     106.495       99.997
SET     107.007       99.997
SET     107.007       99.997
SET     107.007       99.997
SET     108.031       99.998
SET     108.031       99.998
SET     108.031       99.998
SET     113.663       99.998
SET     113.663       99.998
SET     113.663       99.998
[...]
SET     124.415       99.999
SET     124.415       99.999
SET     124.415       99.999
[...]
SET     124.927       99.999
SET     124.927       99.999
SET     124.927       99.999
[...]
SET     135.167      100.000
SET     135.167      100.000
---
GET       0.151        0.000
GET       1.191        5.000
GET       1.255       10.000
GET       1.303       15.000
GET       1.351       20.000
GET       1.383       25.000
GET       1.415       30.000
GET       1.455       35.000
GET       1.495       40.000
GET       1.543       45.000
GET       1.591       50.000
GET       1.623       52.500
GET       1.655       55.000
GET       1.695       57.500
GET       1.743       60.000
GET       1.791       62.500
GET       1.863       65.000
GET       1.975       67.500
GET       2.287       70.000
GET       2.607       72.500
GET       2.783       75.000
GET       2.863       76.250
GET       2.943       77.500
GET       3.023       78.750
GET       3.119       80.000
GET       3.199       81.250
GET       3.295       82.500
GET       3.375       83.750
GET       3.471       85.000
GET       3.567       86.250
GET       3.679       87.500
GET       3.727       88.125
GET       3.775       88.750
GET       3.839       89.375
GET       3.887       90.000
GET       3.935       90.625
GET       3.999       91.250
GET       4.063       91.875
GET       4.127       92.500
GET       4.191       93.125
GET       4.287       93.750
GET       4.319       94.062
GET       4.351       94.375
GET       4.415       94.688
GET       4.447       95.000
GET       4.511       95.312
GET       4.575       95.625
GET       4.639       95.938
GET       4.735       96.250
GET       4.831       96.562
GET       4.959       96.875
GET       5.055       97.031
GET       5.183       97.188
GET       5.375       97.344
GET       5.759       97.500
GET       6.431       97.656
GET       6.911       97.812
GET       7.263       97.969
GET       7.647       98.125
GET       8.063       98.281
GET       8.639       98.438
GET       9.151       98.516
GET      11.967       98.594
GET      29.055       98.672
GET      34.815       98.750
GET      38.143       98.828
GET      40.191       98.906
GET      42.239       98.984
GET      43.775       99.062
GET      45.311       99.141
GET      46.847       99.219
GET      47.615       99.258
GET      48.639       99.297
GET      49.407       99.336
GET      50.175       99.375
GET      51.199       99.414
GET      51.967       99.453
GET      52.991       99.492
GET      53.759       99.531
GET      54.783       99.570
GET      55.807       99.609
GET      56.319       99.629
GET      56.831       99.648
GET      57.599       99.668
GET      58.367       99.688
GET      58.879       99.707
GET      59.647       99.727
GET      60.159       99.746
GET      60.927       99.766
GET      61.695       99.785
GET      62.719       99.805
GET      63.231       99.814
GET      63.743       99.824
GET      64.255       99.834
GET      64.767       99.844
GET      65.279       99.854
GET      66.047       99.863
GET      66.559       99.873
GET      67.583       99.883
GET      68.095       99.893
GET      69.119       99.902
GET      69.631       99.907
GET      70.143       99.912
GET      70.655       99.917
GET      71.167       99.922
GET      71.679       99.927
GET      72.191       99.932
GET      72.703       99.937
GET      73.215       99.941
GET      73.727       99.946
GET      74.751       99.951
GET      74.751       99.954
GET      75.775       99.956
GET      75.775       99.958
GET      76.287       99.961
GET      76.799       99.963
GET      77.311       99.966
GET      77.823       99.968
GET      78.335       99.971
GET      79.359       99.973
GET      80.383       99.976
GET      80.895       99.977
GET      81.407       99.978
GET      81.919       99.979
GET      82.431       99.980
GET      82.943       99.982
GET      83.455       99.983
GET      83.967       99.984
GET      84.991       99.985
GET      85.503       99.987
GET      86.527       99.988
GET      87.039       99.988
GET      87.551       99.989
GET      88.063       99.990
GET      88.575       99.990
GET      89.087       99.991
GET      90.111       99.991
GET      90.623       99.992
GET      92.159       99.993
GET      92.671       99.993
GET      94.207       99.994
GET      94.719       99.994
GET      94.719       99.995
GET      95.231       99.995
GET      95.743       99.995
GET      96.255       99.995
GET      97.279       99.996
GET      97.791       99.996
GET      98.303       99.996
GET      99.327       99.997
GET     100.351       99.997
GET     100.351       99.997
GET     100.863       99.997
GET     101.887       99.997
GET     101.887       99.998
GET     102.399       99.998
GET     102.911       99.998
GET     103.935       99.998
GET     104.959       99.998
GET     105.983       99.998
GET     107.007       99.998
GET     107.519       99.999
GET     108.031       99.999
GET     108.031       99.999
GET     108.031       99.999
GET     109.055       99.999
GET     109.055       99.999
GET     110.079       99.999
GET     110.591       99.999
GET     113.151       99.999
GET     113.151       99.999
GET     113.663       99.999
GET     114.175       99.999
GET     114.175       99.999
GET     114.175       99.999
GET     115.199       99.999
GET     115.199       99.999
GET     115.199      100.000
GET     115.199      100.000
GET     116.223      100.000
GET     116.223      100.000
GET     116.223      100.000
GET     118.271      100.000
GET     118.271      100.000
GET     118.271      100.000
GET     118.783      100.000
GET     118.783      100.000
GET     123.391      100.000
GET     123.391      100.000
GET     123.391      100.000
GET     125.439      100.000
GET     125.439      100.000
GET     125.439      100.000
[...]
GET     130.047      100.000
GET     130.047      100.000
GET     130.047      100.000
[...]
GET     142.335      100.000
GET     142.335      100.000
GET     142.335      100.000
[...]
GET     149.503      100.000
GET     149.503      100.000
---
WAIT      0.000      100.000